#include <iostream>
using namespace std;

// Домашняя работа.

// Выводит массив чисел double
void printArray(const double* arr, const size_t SIZE) {
    for (size_t i = 0; i < SIZE; i++)
    {
        cout << arr[i] << " ";
    }
}

// Меняет значение
void changeTo(int arr[], int SIZE) {
    for (size_t i = 0; i < SIZE; i++) {
        arr[i] == 0 ? arr[i] = 1 : arr[i] = 0;
        cout << arr[i] << " ";
    }
}

// Заполняет пустой массив
void fillArray(int arr[], int SIZE) {
    int j = 1;
    for (size_t i = 1; i < SIZE; i++, j = j + 3) {
        arr[i] = j;
        cout << arr[i] << " ";
    }
}

int main()
{
    // 1. Написать функцию которая выводит массив double чисел на экран. Параметры функции это сам массив и его размер. 
    // Вызвать эту функцию из main.

    const size_t SIZE = 5;
    double arr[SIZE] = { 1, 3, 5, 7, 9 };

    printArray(arr, SIZE);
    cout << endl;

    //======================================================================================================================================

    // 2. Задать целочисленный массив, состоящий из элементов 0 и 1. Например: [ 1, 1, 0, 0, 1, 0, 1, 1, 0, 0 ]. 
    // Написать функцию, заменяющую в принятом массиве 0 на 1, 1 на 0. Выводить на экран массив до изменений и после.

    const size_t SIZE2 = 10;
    int array[SIZE2] = { 1, 1, 0, 0, 1, 0, 1, 1, 0, 0 };

    changeTo(array, SIZE2);
    cout << endl;

    //======================================================================================================================================

    // 3. Задать пустой целочисленный массив размером 8. Написать функцию, которая с помощью цикла заполнит его значениями 
    // 1 4 7 10 13 16 19 22. Вывести массив на экран.

    const size_t SIZE3 = 9;
    int arr2[SIZE3];

    fillArray(arr2, SIZE3);

    //======================================================================================================================================
}
